avrxml/AS6-Devices-XML/ATSAM4S8C.xml
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 1" name="MATRIX_PRAS1" offset="0x0088" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 2" name="MATRIX_PRAS2" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 3" name="MATRIX_PRAS3" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 4" name="MATRIX_PRAS4" offset="0x00A0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="System I/O Configuration register" name="CCFG_SYSIO" offset="0x0114" rw="RW" size="4">
          <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
          <bitfield caption="PB5 or TDO/TRACESWO Assignment" mask="0x00000020" name="SYSIO5"/>
          <bitfield caption="PB6 or TMS/SWDIO Assignment" mask="0x00000040" name="SYSIO6"/>
          <bitfield caption="PB7 or TCK/SWCLK Assignment" mask="0x00000080" name="SYSIO7"/>
          <bitfield caption="PB10 or DDM Assignment" mask="0x00000400" name="SYSIO10"/>
          <bitfield caption="PB11 or DDP Assignment" mask="0x00000800" name="SYSIO11"/>
          <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
        </register>
        <register caption="SMC Chip Select NAND Flash Assignment Register" name="CCFG_SMCNFCS" offset="0x011C" rw="RW" size="4">
          <bitfield caption="SMC NAND Flash Chip Select 0 Assignment" mask="0x00000001" name="SMC_NFCS0"/>
          <bitfield caption="SMC NAND Flash Chip Select 1 Assignment" mask="0x00000002" name="SMC_NFCS1"/>
          <bitfield caption="SMC NAND Flash Chip Select 2 Assignment" mask="0x00000004" name="SMC_NFCS2"/>
          <bitfield caption="SMC NAND Flash Chip Select 3 Assignment" mask="0x00000008" name="SMC_NFCS3"/>
        </register>
        <register caption="Write Protect Mode Register" name="MATRIX_WPMR" offset="0x1E4" rw="RW" size="4">
          <bitfield caption="Write Protect ENable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY (Write-only)" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="MATRIX_WPSR" offset="0x1E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
    </module>
    <module caption="Peripheral DMA Controller" name="PDC" version="6031B">
      <register-group name="PDC">
        <register caption="Receive Pointer Register" name="PERIPH_RPR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PERIPH_RCR" offset="0x4" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="PERIPH_TPR" offset="0x8" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="PERIPH_TCR" offset="0xC" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PERIPH_RNPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PERIPH_RNCR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="PERIPH_TNPR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="PERIPH_TNCR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PERIPH_PTCR" offset="0x20" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PERIPH_PTSR" offset="0x24" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
    </module>
