avrxml/AS6-Devices-XML/ATSAM4S8C.xml
        <register caption="Interrupt Mask Register" name="SSC_IMR" offset="0x4C" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Mask" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="End of Transmission Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000008" name="TXBUFE"/>
          <bitfield caption="Receive Ready Interrupt Mask" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Mask" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="End of Reception Interrupt Mask" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000080" name="RXBUFF"/>
          <bitfield caption="Compare 0 Interrupt Mask" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Mask" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Mask" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Mask" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Write Protect Mode Register" name="SSC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="SSC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="SSC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="SSC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="SSC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="SSC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="SSC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="SSC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="SSC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="SSC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="SSC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="SSC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="SSC_RCMR__CKS">
        <value caption="Divided Clock" name="MCK" value="0x0"/>
        <value caption="TK Clock signal" name="TK" value="0x1"/>
        <value caption="RK pin" name="RK" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__CKO">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Continuous Receive Clock" name="CONTINUOUS" value="0x1"/>
        <value caption="Receive Clock only during data transfers" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__CKG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Continuous Receive Clock" name="CONTINUOUS" value="0x1"/>
        <value caption="Receive Clock only during data transfers" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__START">
        <value caption="Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data." name="CONTINUOUS" value="0x0"/>
        <value caption="Transmit start" name="TRANSMIT" value="0x1"/>
        <value caption="Detection of a low level on RF signal" name="RF_LOW" value="0x2"/>
        <value caption="Detection of a high level on RF signal" name="RF_HIGH" value="0x3"/>
        <value caption="Detection of a falling edge on RF signal" name="RF_FALLING" value="0x4"/>
        <value caption="Detection of a rising edge on RF signal" name="RF_RISING" value="0x5"/>
        <value caption="Detection of any level change on RF signal" name="RF_LEVEL" value="0x6"/>
        <value caption="Detection of any edge on RF signal" name="RF_EDGE" value="0x7"/>
        <value caption="Compare 0" name="CMP_0" value="0x8"/>
      </value-group>
      <value-group caption="" name="SSC_RFMR__FSOS">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Negative Pulse" name="NEGATIVE" value="0x1"/>
        <value caption="Positive Pulse" name="POSITIVE" value="0x2"/>
        <value caption="Driven Low during data transfer" name="LOW" value="0x3"/>
        <value caption="Driven High during data transfer" name="HIGH" value="0x4"/>
        <value caption="Toggling at each start of data transfer" name="TOGGLING" value="0x5"/>
      </value-group>
      <value-group caption="" name="SSC_RFMR__FSEDGE">
        <value caption="Positive Edge Detection" name="POSITIVE" value="0"/>
        <value caption="Negative Edge Detection" name="NEGATIVE" value="1"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKS">
        <value caption="Divided Clock" name="MCK" value="0x0"/>
        <value caption="TK Clock signal" name="TK" value="0x1"/>
        <value caption="RK pin" name="RK" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKO">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Continuous Receive Clock" name="CONTINUOUS" value="0x1"/>
        <value caption="Transmit Clock only during data transfers" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Transmit Clock enabled only if TF Low" name="CONTINUOUS" value="0x1"/>
        <value caption="Transmit Clock enabled only if TF High" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__START">
        <value caption="Continuous, as soon as a word is written in the SSC_THR Register (if Transmit is enabled), and immediately after the end of transfer of the previous data." name="CONTINUOUS" value="0x0"/>
        <value caption="Receive start" name="RECEIVE" value="0x1"/>
        <value caption="Detection of a low level on TF signal" name="RF_LOW" value="0x2"/>
        <value caption="Detection of a high level on TF signal" name="RF_HIGH" value="0x3"/>
        <value caption="Detection of a falling edge on TF signal" name="RF_FALLING" value="0x4"/>
        <value caption="Detection of a rising edge on TF signal" name="RF_RISING" value="0x5"/>
        <value caption="Detection of any level change on TF signal" name="RF_LEVEL" value="0x6"/>
        <value caption="Detection of any edge on TF signal" name="RF_EDGE" value="0x7"/>
        <value caption="Compare 0" name="CMP_0" value="0x8"/>
      </value-group>
      <value-group caption="" name="SSC_TFMR__FSOS">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Negative Pulse" name="NEGATIVE" value="0x1"/>
        <value caption="Positive Pulse" name="POSITIVE" value="0x2"/>
        <value caption="Driven Low during data transfer" name="LOW" value="0x3"/>
        <value caption="Driven High during data transfer" name="HIGH" value="0x4"/>
        <value caption="Toggling at each start of data transfer" name="TOGGLING" value="0x5"/>
      </value-group>
